Public Attributes | List of all members
API_AnalyticalLink_SpringSettings Struct Reference
Analytical Model
Describes the spring settings of the Structural Analytical Model Analytical Link element. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalCoordSysDirection  | direction
Coordinate system direction settings.
API_AnalyticalLink_Translation  | translation
Translation settings.
API_AnalyticalLink_Rotation  | rotation
Rotation settings.
Detailed Description
Describes the spring settings of the Structural Analytical Model Analytical Link element.
Since
Archicad 25
Member Data Documentation
◆ direction
 API_AnalyticalLink_SpringSettings::direction
Coordinate system direction settings.
◆ rotation
 API_AnalyticalLink_SpringSettings::rotation
Rotation settings.
◆ translation
 API_AnalyticalLink_SpringSettings::translation
Translation settings.